60-Deployment/blogger/backend/app/controllers/hogs_controller.rb

  def index
    render json: Hog.all.sort_by{ |hog| -hog.id}
---
SELECT "hogs".* FROM "hogs"

  def create
    render json: Hog.create(hog_params)
---
INSERT INTO "hogs" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Rob"], ["created_at", "2019-05-14 12:42:38.252465"], ["updated_at", "2019-05-14 12:42:38.252465"]]