39-Rails-API/cats-backend/app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats"
SELECT "hobbies".* FROM "hobbies" INNER JOIN "cat_hobbies" ON "hobbies"."id" = "cat_hobbies"."hobby_id" WHERE "cat_hobbies"."cat_id" = $1  [["cat_id", 5]]
---
  def index
    render json: Cat.all.as_json(:include => :hobbies)

SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def show
    cat = Cat.find(params[:id])

SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "cats" WHERE "cats"."id" = $1  [["id", 8]]
---
  def destroy
    cat = Cat.find(params[:id])
    cat.destroy

INSERT INTO "cats" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2020-04-27 16:56:52.920659"], ["updated_at", "2020-04-27 16:56:52.920659"]]
---
  def create
    cat = Cat.create(cat_params)