43-OOJS-and-SPA/pokemon-teams-backend/app/controllers/pokemons_controller.rb

SELECT  "trainers".* FROM "trainers" WHERE "trainers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."trainer_id" = ?  [["trainer_id", 1]]
INSERT INTO "pokemons" ("species", "nickname", "trainer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["species", "Staryu"], ["nickname", "Della"], ["trainer_id", 1], ["created_at", "2019-08-04 21:39:30.910471"], ["updated_at", "2019-08-04 21:39:30.910471"]]
---
  def create
    trainer = Trainer.find(params[:trainer_id])
    if trainer
      if trainer.pokemons.length < 6
        name = Faker::Name.first_name
        species = Faker::Games::Pokemon.name
        pokemon = Pokemon.create(nickname: name, species: species, trainer_id: trainer.id)

SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT ?  [["id", 32], ["LIMIT", 1]]
DELETE FROM "pokemons" WHERE "pokemons"."id" = ?  [["id", 32]]
---
  def destroy
    pokemon = Pokemon.find(params[:id])
    render json: pokemon.destroy.to_json(:except => [:created_at, :update_at])