43-OOJS-and-SPA/pokemon-teams-backend/app/controllers/trainers_controller.rb

SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."trainer_id" = ?  [["trainer_id", 1]]
SELECT "trainers".* FROM "trainers"
---
  def index
    render json: Trainer.all.to_json(
      :include => {:pokemons => {:except => [:created_at, :updated_at]}},
      :except => [:created_at, :updated_at]
    )